cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/science'

brew 'ack'
brew 'coreutils'
brew 'go'
brew 'grc'
brew 'imagemagick'
brew 'jp2a'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'openssl'
brew 'node'
brew 'readline'
brew 'postgresql'
brew 'ruby-build'
brew 'rbenv'
brew 'roundup'
brew 'spark'
brew 'unrar'
brew 'youtube-dl'
brew 'luajit'
brew 'htop'
brew 'docker'
brew 'docker-machine'
brew 'docker-compose'
brew 'wget'
brew 'snappy'
brew 'leveldb'
brew 'glog'
brew 'szip'
brew 'lmdb'
brew 'hdf5'
brew 'opencv'
brew 'fftw'
brew 'sox'
brew 'lua'
brew 'gdal'
brew 'dos2unix'
brew 'sdl'
brew 'sdl_ttf'
brew 'hadoop'
brew 'sbt'
brew 'thrift'
brew 'scala'
brew 'openni'
brew 'watch'
brew 'pandoc'
brew 'rust'
brew 'apache-spark'
brew 'kafka'
brew 'vowpal-wabbit'
brew 'elasticsearch'
brew 'kibana'
brew 'tippecanoe'
brew 'postgis'
brew 'gdb'
brew 'heroku-toolbelt'
brew 'neo4j'
brew 's3cmd'
brew 'libzip'
brew 'libstxxl'
brew 'lua51'
brew 'luabind'
brew 'fio'
brew 'mapnik'
brew 'nvm'
brew 'randomize-lines'
brew 'gnu-sed'
brew 'gnumeric'
brew 'mp3info'
brew 'mediainfo'
brew 'wine'

cask '1password'
cask 'adium'
cask 'atom'
cask 'firefox'
cask 'garmin-express'
cask 'google-chrome'
cask 'handbrake'
cask 'mapbox-studio'
cask 'seashore'
cask 'slack'
cask 'steam'
cask 'transmission'
cask 'tunnelbear'
cask 'vlc'
cask 'tableau-public'
cask 'tableau'
cask 'rstudio'
cask 'sketch'
cask 'dash'
cask 'alfred'
cask 'dropbox'
cask 'istat-menus'
cask 'omnigraffle'
cask 'balsamiq-mockups'
cask 'datagrip'
cask 'caffeine'
cask 'vagrant'
cask 'mactex'
cask 'qgis'
cask 'sublime-text'
cask 'josm'
cask 'zerobranestudio'
cask 'vmware-fusion'
cask 'tripmode'
cask 'qgis'
cask 'camtasia'
cask 'pycharm'
cask 'sketch-toolbox'
cask 'rightfont'
cask 'virtualbox'
cask 'github-desktop'
cask 'josm'
cask 'cyberghost'
cask 'iterm2'
cask 'rubymine'
cask 'appcode'
cask 'webstorm'
cask 'gitter'
cask 'microsoft-office'
cask 'qwik'
cask 'ngrok'
cask 'origami'
cask 'unity'
cask 'zxpinstaller'
